In [2]:
import os 
import pandas as pd

In [3]:
path = ('D:\Downloads\py\Master Courses\TFM\Data\Datasets\Kaggle_students_math_score')
os.chdir(path)

In [4]:
df = pd.read_spss("1ResearchProjectData.sav")

In [5]:
df.head()

   Student Teacher  Gender            Ethnic    Freeredu  Score       wesson
0      1.0   Ruger  Female             Asian  Free lunch   76.0  Ruger_Smith
1      2.0   Ruger  Female          Hispanic  Paid lunch   56.0  Ruger_Smith
2      3.0   Ruger  Female  African-American  Free lunch   34.0  Ruger_Smith
3      4.0   Ruger  Female             Asian  Paid lunch   59.0  Ruger_Smith
4      5.0   Ruger    Male          Hispanic  Free lunch   73.0  Ruger_Smith

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217 entries, 0 to 216
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Student   216 non-null    float64
 1   Teacher   216 non-null    category
 2   Gender    216 non-null    category
 3   Ethnic    216 non-null    category
 4   Freeredu  216 non-null    category
 5   Score     216 non-null    float64
 6   wesson    217 non-null    category
dtypes: category(5), float64(2)
memory usage: 5.3 KB

In [7]:
df.describe()

       Student       Score
count  216.000  216.000000
mean   108.500   65.273148
std     62.498   16.361453
min      1.000   30.000000
25%     54.750   53.000000
50%    108.500   65.000000
75%    162.250   79.000000
max    216.000   95.000000